duvallee/STM32F746Discovery/Src/usb/usbd_conf.c
/**
  ******************************************************************************
  * @file           : usbd_conf.c
  * @version        : v1.0_Cube
  * @brief          : This file implements the board support package for the USB device library
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
*/
/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "main.h"
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "debug_output.h"

#include "cmsis_os.h"

#include "usbd_def.h"
#include "usbd_core.h"


PCD_HandleTypeDef hpcd_USB_OTG_FS;
void _Error_Handler(char * file, int line);
PCD_HandleTypeDef hpcd_USB_OTG_HS;
void _Error_Handler(char * file, int line);

/* External functions --------------------------------------------------------*/
void SystemClock_Config(void);

/*******************************************************************************
                       LL Driver Callbacks (PCD -> USB Device Library)
*******************************************************************************/
void HAL_PCD_MspInit(PCD_HandleTypeDef* pcdHandle)
{
   GPIO_InitTypeDef GPIO_InitStruct;
   if (pcdHandle->Instance == USB_OTG_FS)
   {
      /**USB_OTG_FS GPIO Configuration    
      PA12     ------> USB_OTG_FS_DP
      PA11     ------> USB_OTG_FS_DM
      PA10     ------> USB_OTG_FS_ID
      PJ12     ------> USB_OTG_FS_VBUS
      */
      GPIO_InitStruct.Pin                                = GPIO_PIN_12 | GPIO_PIN_11 | GPIO_PIN_10;
      GPIO_InitStruct.Mode                               = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull                               = GPIO_NOPULL;
      GPIO_InitStruct.Speed                              = GPIO_SPEED_FREQ_VERY_HIGH;
      GPIO_InitStruct.Alternate                          = GPIO_AF10_OTG_FS;
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

      // PJ12 : USB_OTG_FS_VBUS
      GPIO_InitStruct.Pin                                = GPIO_PIN_12;
      GPIO_InitStruct.Mode                               = GPIO_MODE_IT_RISING_FALLING;
      GPIO_InitStruct.Pull                               = GPIO_NOPULL;
      GPIO_InitStruct.Speed                              = GPIO_SPEED_FREQ_LOW;
      HAL_GPIO_Init(GPIOJ, &GPIO_InitStruct);

      /* Peripheral clock enable */
      __HAL_RCC_USB_OTG_FS_CLK_ENABLE();

      /* Peripheral interrupt init */
      HAL_NVIC_SetPriority(OTG_FS_IRQn, 7, 0);
      HAL_NVIC_EnableIRQ(OTG_FS_IRQn);

      // EXTI interrupt init for PI12 (EXTI 12)
      /* The highest interrupt priority that can be used by any interrupt service
         routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
         INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
         PRIORITY THAN THIS! (higher priorities are lower numeric values. */
      HAL_NVIC_SetPriority(EXTI15_10_IRQn,  configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY + 1, 0);
      HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
   }
  
}

void HAL_PCD_MspDeInit(PCD_HandleTypeDef* pcdHandle)
{
   if (pcdHandle->Instance == USB_OTG_FS)
   {
      /* Peripheral clock disable */
      __HAL_RCC_USB_OTG_FS_CLK_DISABLE();

      /**USB_OTG_FS GPIO Configuration    
      PA12     ------> USB_OTG_FS_DP
      PA11     ------> USB_OTG_FS_DM 
      */
      HAL_GPIO_DeInit(GPIOA, GPIO_PIN_12 | GPIO_PIN_11 | GPIO_PIN_9);

      /* Peripheral interrupt Deinit*/
      HAL_NVIC_DisableIRQ(OTG_FS_IRQn);
   }
}

/**
  * @brief  Setup stage callback
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
   USBD_LL_SetupStage((USBD_HandleTypeDef*)hpcd->pData, (uint8_t *)hpcd->Setup);
}

/**
  * @brief  Data Out stage callback.
  * @param  hpcd: PCD handle
  * @param  epnum: Endpoint Number
  * @retval None
  */
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
   USBD_LL_DataOutStage((USBD_HandleTypeDef*)hpcd->pData, epnum, hpcd->OUT_ep[epnum].xfer_buff);
}

/**
  * @brief  Data In stage callback..
  * @param  hpcd: PCD handle
  * @param  epnum: Endpoint Number
  * @retval None
  */
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
   USBD_LL_DataInStage((USBD_HandleTypeDef*)hpcd->pData, epnum, hpcd->IN_ep[epnum].xfer_buff);
}

/**
  * @brief  SOF callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
   USBD_LL_SOF((USBD_HandleTypeDef*)hpcd->pData);
}

/**
  * @brief  Reset callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{ 
   USBD_SpeedTypeDef speed                               = USBD_SPEED_FULL;

   /*Set USB Current Speed*/
   switch (hpcd->Init.speed)
   {
      case PCD_SPEED_HIGH :
         speed                                           = USBD_SPEED_HIGH;
         break;

