duvallee/STM32F746Discovery/Src/usb/usbd_conf.c
      case PCD_SPEED_FULL :
         speed                                           = USBD_SPEED_FULL;
         break;

      default :
         speed                                           = USBD_SPEED_FULL;
         break;    
   }
   USBD_LL_SetSpeed((USBD_HandleTypeDef*)hpcd->pData, speed);

   /*Reset Device*/
   USBD_LL_Reset((USBD_HandleTypeDef*)hpcd->pData);
}

/**
  * @brief  Suspend callback.
  * When Low power mode is enabled the debug cannot be used (IAR, Keil doesn't support it)
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{  
   /* Inform USB library that core enters in suspend Mode */
   USBD_LL_Suspend((USBD_HandleTypeDef*)hpcd->pData);
   __HAL_PCD_GATE_PHYCLOCK(hpcd);

   /*Enter in STOP mode */
   if (hpcd->Init.low_power_enable)
   {
      /* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register */
      SCB->SCR                                           |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
   }
}

/**
  * @brief  Resume callback.
    When Low power mode is enabled the debug cannot be used (IAR, Keil doesn't support it)
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
   USBD_LL_Resume((USBD_HandleTypeDef*)hpcd->pData);
}

/**
  * @brief  ISOC Out Incomplete callback.
  * @param  hpcd: PCD handle
  * @param  epnum: Endpoint Number
  * @retval None
  */
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
   USBD_LL_IsoOUTIncomplete((USBD_HandleTypeDef*)hpcd->pData, epnum);
}

/**
  * @brief  ISOC In Incomplete callback.
  * @param  hpcd: PCD handle
  * @param  epnum: Endpoint Number
  * @retval None
  */
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
   USBD_LL_IsoINIncomplete((USBD_HandleTypeDef*)hpcd->pData, epnum);
}

/**
  * @brief  Connect callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
   USBD_LL_DevConnected((USBD_HandleTypeDef*)hpcd->pData);
}

/**
  * @brief  Disconnect callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
   USBD_LL_DevDisconnected((USBD_HandleTypeDef*)hpcd->pData);
}


#if defined(DEBUG_OUTPUT_USB)
/* --------------------------------------------------------------------------
 * Name : USBD_LL_Cable_Detect()
 *
 *
 * -------------------------------------------------------------------------- */
extern osSemaphoreId usb_Cable_detect_Semaphore;
#ifdef TIME_WAITING_FOR_INPUT
#undef TIME_WAITING_FOR_INPUT
#endif

#define TIME_WAITING_FOR_INPUT                           (uint32_t) 0xffffffffUL

void USBD_LL_Cable_Detect(void const * argument)
{
   USBD_HandleTypeDef* pUsbDeviceFS                      = (USBD_HandleTypeDef*) argument;

   while (1)
   {
      if (osSemaphoreWait(usb_Cable_detect_Semaphore, TIME_WAITING_FOR_INPUT) == osOK)
      {
         if (HAL_GPIO_ReadPin(GPIOJ, GPIO_PIN_12) == GPIO_PIN_RESET)
         {
            USBD_LL_Stop(pUsbDeviceFS);
         }
         else
         {
            USBD_Start(pUsbDeviceFS);
         }
      }
   }

}
#endif

/*******************************************************************************
                       LL Driver Interface (USB Device Library --> PCD)
*******************************************************************************/
/**
  * @brief  Initializes the Low Level portion of the Device driver.
  * @param  pdev: Device handle
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_Init (USBD_HandleTypeDef *pdev)
{ 
   /* Init USB_IP */
   if (pdev->id == DEVICE_FS)
   {
      /* Link The driver to the stack */	
      hpcd_USB_OTG_FS.pData                              = pdev;
      pdev->pData                                        = &hpcd_USB_OTG_FS; 

      hpcd_USB_OTG_FS.Instance                           = USB_OTG_FS;
      hpcd_USB_OTG_FS.Init.dev_endpoints                 = 6;
      hpcd_USB_OTG_FS.Init.speed                         = PCD_SPEED_FULL;
      hpcd_USB_OTG_FS.Init.dma_enable                    = DISABLE;
      hpcd_USB_OTG_FS.Init.ep0_mps                       = DEP0CTL_MPS_64;
      hpcd_USB_OTG_FS.Init.phy_itface                    = PCD_PHY_EMBEDDED;
      hpcd_USB_OTG_FS.Init.Sof_enable                    = DISABLE;
      hpcd_USB_OTG_FS.Init.low_power_enable              = DISABLE;
      hpcd_USB_OTG_FS.Init.lpm_enable                    = DISABLE;
      hpcd_USB_OTG_FS.Init.vbus_sensing_enable           = DISABLE;
      hpcd_USB_OTG_FS.Init.use_dedicated_ep1             = DISABLE;
      if (HAL_PCD_Init(&hpcd_USB_OTG_FS) != HAL_OK)
      {
         _Error_Handler(__FILE__, __LINE__);
      }

      HAL_PCDEx_SetRxFiFo(&hpcd_USB_OTG_FS, 0x80);
      HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG_FS, 0, 0x40);
      HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG_FS, 1, 0x80);
   }

   return USBD_OK;
}

/**
  * @brief  De-Initializes the Low Level portion of the Device driver.
  * @param  pdev: Device handle
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_DeInit (USBD_HandleTypeDef *pdev)
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_DeInit(pdev->pData);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status; 
}

/**
  * @brief  Starts the Low Level portion of the Device driver. 
  * @param  pdev: Device handle
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_Start(USBD_HandleTypeDef *pdev)
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_Start(pdev->pData);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

