duvallee/STM32F746Discovery/Src/usb/usbd_conf.c
      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status;  
}

/**
  * @brief  Stops the Low Level portion of the Device driver.
  * @param  pdev: Device handle
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_Stop (USBD_HandleTypeDef *pdev)
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_Stop(pdev->pData);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status; 
}

/**
  * @brief  Opens an endpoint of the Low Level Driver.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @param  ep_type: Endpoint Type
  * @param  ep_mps: Endpoint Max Packet Size                 
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_OpenEP  (USBD_HandleTypeDef *pdev, uint8_t ep_addr, uint8_t ep_type, uint16_t ep_mps)
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_EP_Open(pdev->pData, ep_addr, ep_mps, ep_type);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status; 
}

/**
  * @brief  Closes an endpoint of the Low Level Driver.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_CloseEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_EP_Close(pdev->pData, ep_addr);
      
   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status;  
}

/**
  * @brief  Flushes an endpoint of the Low Level Driver.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_FlushEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_EP_Flush(pdev->pData, ep_addr);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status;  
}

/**
  * @brief  Sets a Stall condition on an endpoint of the Low Level Driver.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_StallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_EP_SetStall(pdev->pData, ep_addr);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status;  
}

/**
  * @brief  Clears a Stall condition on an endpoint of the Low Level Driver.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_ClearStallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

