duvallee/STM32F746Discovery/Src/usb/usbd_conf.c
   hal_status                                            = HAL_PCD_EP_ClrStall(pdev->pData, ep_addr);  

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status; 
}

/**
  * @brief  Returns Stall condition.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval Stall (1: Yes, 0: No)
  */
uint8_t USBD_LL_IsStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
   PCD_HandleTypeDef *hpcd                               = (PCD_HandleTypeDef*) pdev->pData;

   if ((ep_addr & 0x80) == 0x80)
   {
      return hpcd->IN_ep[ep_addr & 0x7F].is_stall; 
   }
   else
   {
      return hpcd->OUT_ep[ep_addr & 0x7F].is_stall; 
   }
}

/**
  * @brief  Assigns a USB address to the device.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_SetUSBAddress (USBD_HandleTypeDef *pdev, uint8_t dev_addr)   
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_SetAddress(pdev->pData, dev_addr);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status;  
}

/**
  * @brief  Transmits data over an endpoint.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @param  pbuf: Pointer to data to be sent
  * @param  size: Data size    
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_Transmit (USBD_HandleTypeDef *pdev, uint8_t ep_addr, uint8_t* pbuf, uint16_t size)
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_EP_Transmit(pdev->pData, ep_addr, pbuf, size);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status;    
}

/**
  * @brief  Prepares an endpoint for reception.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @param  pbuf: Pointer to data to be received
  * @param  size: Data size
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_PrepareReceive(USBD_HandleTypeDef *pdev, uint8_t ep_addr, uint8_t* pbuf, uint16_t size)
{
   HAL_StatusTypeDef hal_status                          = HAL_OK;
   USBD_StatusTypeDef usb_status                         = USBD_OK;

   hal_status                                            = HAL_PCD_EP_Receive(pdev->pData, ep_addr, pbuf, size);

   switch (hal_status)
   {
      case HAL_OK :
         usb_status                                      = USBD_OK;
         break;

      case HAL_ERROR :
         usb_status                                      = USBD_FAIL;
         break;

      case HAL_BUSY :
         usb_status                                      = USBD_BUSY;
         break;

      case HAL_TIMEOUT :
         usb_status                                      = USBD_FAIL;
         break;

      default :
         usb_status                                      = USBD_FAIL;
         break;
   }
   return usb_status; 
}

/**
  * @brief  Returns the last transfered packet size.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval Recived Data Size
  */
uint32_t USBD_LL_GetRxDataSize(USBD_HandleTypeDef *pdev, uint8_t ep_addr)  
{
   return HAL_PCD_EP_GetRxCount((PCD_HandleTypeDef*) pdev->pData, ep_addr);
}

#if (USBD_LPM_ENABLED == 1)
/**
  * @brief  HAL_PCDEx_LPM_Callback : Send LPM message to user layer
  * @param  hpcd: PCD handle
  * @param  msg: LPM message
  * @retval HAL status
  */
void HAL_PCDEx_LPM_Callback(PCD_HandleTypeDef *hpcd, PCD_LPM_MsgTypeDef msg)
{
   switch (msg)
   {
      case PCD_LPM_L0_ACTIVE :
         if (hpcd->Init.low_power_enable)
         {
            SystemClock_Config();

            /* Reset SLEEPDEEP bit of Cortex System Control Register */
            SCB->SCR                                     &= (uint32_t)~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
         }
         __HAL_PCD_UNGATE_PHYCLOCK(hpcd);
         USBD_LL_Resume(hpcd->pData);    
         break;

      case PCD_LPM_L1_ACTIVE :
         __HAL_PCD_GATE_PHYCLOCK(hpcd);
         USBD_LL_Suspend(hpcd->pData);

         /*Enter in STOP mode */
         if (hpcd->Init.low_power_enable)
         {   
            /* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register */
            SCB->SCR                                     |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
         }     
         break;   
   }
}
#endif

/**
  * @brief  Delays routine for the USB Device Library.
  * @param  Delay: Delay in ms
  * @retval None
  */
void USBD_LL_Delay (uint32_t Delay)
{
   HAL_Delay(Delay);
}

